/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   checkLines.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ahector <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/07/10 13:57:38 by ahector           #+#    #+#             */
/*   Updated: 2021/07/10 16:26:27 by ahector          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
 * Функция считает кол-во символов в строке и возвращает её длину,
 *	если строка заканчивается терменирующим нулём '\0'
 */
int	ft_strlen(char *str)
{
	int	i;

	i = 0;
	while (str[i])
		i++;
	return (i);
}

/*
 * Функция проверяет количество символов в двумерном массиве(карте)
 *	Если ошибок нет, то возвращаем 0, если вдруг есть какое-то несовпадение,
 *	то возвращаем 1
 */
int	checkLines(char *str[])
{
	int	i;
	int	cmp;

	i = 0;
	cmp = ft_strlen(str[0]);
	while (str[i + 1])
	{
		if (cmp != ft_strlen(str[i]))
			return (1);
		cmp = ft_strlen(str[i]);
		i++;
	}
	return (0);
}
